cactorium/msp430-musical-quine/test.c
// Once upon a midnight dreary, while I pondered, weak and weary, 
// Over many a quaint and curious volume of forgotten lore— 
//     While I nodded, nearly napping, suddenly there came a tapping, 
// As of some one gently rapping, rapping at my chamber door. 
// “’Tis some visitor,” I muttered, “tapping at my chamber door— 
//             Only this and nothing more.” 
// 
//     Ah, distinctly I remember it was in the bleak December; 
// And each separate dying ember wrought its ghost upon the floor. 
//     Eagerly I wished the morrow;—vainly I had sought to borrow 
//     From my books surcease of sorrow—sorrow for the lost Lenore— 
// For the rare and radiant maiden whom the angels name Lenore— 
//             Nameless here for evermore. 
// 
//     And the silken, sad, uncertain rustling of each purple curtain 
// Thrilled me—filled me with fantastic terrors never felt before; 
//     So that now, to still the beating of my heart, I stood repeating 
//     “’Tis some visitor entreating entrance at my chamber door— 
// Some late visitor entreating entrance at my chamber door;— 
//             This it is and nothing more.” 
// 
//     Presently my soul grew stronger; hesitating then no longer, 
// “Sir,” said I, “or Madam, truly your forgiveness I implore; 
//     But the fact is I was napping, and so gently you came rapping, 
//     And so faintly you came tapping, tapping at my chamber door, 
// That I scarce was sure I heard you”—here I opened wide the door;— 
//             Darkness there and nothing more. 
// 
//     Deep into that darkness peering, long I stood there wondering, fearing, 
// Doubting, dreaming dreams no mortal ever dared to dream before; 
//     But the silence was unbroken, and the stillness gave no token, 
//     And the only word there spoken was the whispered word, “Lenore?” 
// This I whispered, and an echo murmured back the word, “Lenore!”— 
//             Merely this and nothing more. 
// 
//     Back into the chamber turning, all my soul within me burning, 
// Soon again I heard a tapping somewhat louder than before. 
//     “Surely,” said I, “surely that is something at my window lattice; 
//       Let me see, then, what thereat is, and this mystery explore— 
// Let my heart be still a moment and this mystery explore;— 
//             ’Tis the wind and nothing more!” 
// 
//     Open here I flung the shutter, when, with many a flirt and flutter, 
// In there stepped a stately Raven of the saintly days of yore; 
//     Not the least obeisance made he; not a minute stopped or stayed he; 
//     But, with mien of lord or lady, perched above my chamber door— 
// Perched upon a bust of Pallas just above my chamber door— 
//             Perched, and sat, and nothing more. 
// 
// Then this ebony bird beguiling my sad fancy into smiling, 
// By the grave and stern decorum of the countenance it wore, 
// “Though thy crest be shorn and shaven, thou,” I said, “art sure no craven, 
// Ghastly grim and ancient Raven wandering from the Nightly shore— 
// Tell me what thy lordly name is on the Night’s Plutonian shore!” 
//             Quoth the Raven “Nevermore.” 
// 
//     Much I marvelled this ungainly fowl to hear discourse so plainly, 
// Though its answer little meaning—little relevancy bore; 
//     For we cannot help agreeing that no living human being 
//     Ever yet was blessed with seeing bird above his chamber door— 
// Bird or beast upon the sculptured bust above his chamber door, 
//             With such name as “Nevermore.” 
// 
//     But the Raven, sitting lonely on the placid bust, spoke only 
// That one word, as if his soul in that one word he did outpour. 
//     Nothing farther then he uttered—not a feather then he fluttered— 
//     Till I scarcely more than muttered “Other friends have flown before— 
// On the morrow he will leave me, as my Hopes have flown before.” 
//             Then the bird said “Nevermore.” 
// 
//     Startled at the stillness broken by reply so aptly spoken, 
// “Doubtless,” said I, “what it utters is its only stock and store 
//     Caught from some unhappy master whom unmerciful Disaster 
//     Followed fast and followed faster till his songs one burden bore— 
// Till the dirges of his Hope that melancholy burden bore 
//             Of ‘Never—nevermore’.” 
// 
//     But the Raven still beguiling all my fancy into smiling, 
// Straight I wheeled a cushioned seat in front of bird, and bust and door; 
//     Then, upon the velvet sinking, I betook myself to linking 
//     Fancy unto fancy, thinking what this ominous bird of yore— 
// What this grim, ungainly, ghastly, gaunt, and ominous bird of yore 
//             Meant in croaking “Nevermore.” 
// 
//     This I sat engaged in guessing, but no syllable expressing 
// To the fowl whose fiery eyes now burned into my bosom’s core; 
//     This and more I sat divining, with my head at ease reclining 
//     On the cushion’s velvet lining that the lamp-light gloated o’er, 
// But whose velvet-violet lining with the lamp-light gloating o’er, 
//             She shall press, ah, nevermore! 
// 
//     Then, methought, the air grew denser, perfumed from an unseen censer 
// Swung by Seraphim whose foot-falls tinkled on the tufted floor. 
//     “Wretch,” I cried, “thy God hath lent thee—by these angels he hath sent thee 
//     Respite—respite and nepenthe from thy memories of Lenore; 
// Quaff, oh quaff this kind nepenthe and forget this lost Lenore!” 
//             Quoth the Raven “Nevermore.” 
// 
//     “Prophet!” said I, “thing of evil!—prophet still, if bird or devil!— 
// Whether Tempter sent, or whether tempest tossed thee here ashore, 
//     Desolate yet all undaunted, on this desert land enchanted— 
//     On this home by Horror haunted—tell me truly, I implore— 
// Is there—is there balm in Gilead?—tell me—tell me, I implore!” 
//             Quoth the Raven “Nevermore.” 
// 
//     “Prophet!” said I, “thing of evil!—prophet still, if bird or devil! 
// By that Heaven that bends above us—by that God we both adore— 
//     Tell this soul with sorrow laden if, within the distant Aidenn, 
//     It shall clasp a sainted maiden whom the angels name Lenore— 
// Clasp a rare and radiant maiden whom the angels name Lenore.” 
//             Quoth the Raven “Nevermore.” 
// 
//     “Be that word our sign of parting, bird or fiend!” I shrieked, upstarting— 
// “Get thee back into the tempest and the Night’s Plutonian shore! 
//     Leave no black plume as a token of that lie thy soul hath spoken! 
//     Leave my loneliness unbroken!—quit the bust above my door! 
// Take thy beak from out my heart, and take thy form from off my door!” 
//             Quoth the Raven “Nevermore.” 
// 
//     And the Raven, never flitting, still is sitting, still is sitting 
// On the pallid bust of Pallas just above my chamber door; 
//     And his eyes have all the seeming of a demon’s that is dreaming, 
//     And the lamp-light o’er him streaming throws his shadow on the floor; 
// And my soul from out that shadow that lies floating on the floor 
//             Shall be lifted—nevermore!

#include <string.h>
#include <msp430x20x2.h>

const char query_str[] = "codepls";

void print_code();

int main() {
  // turn off WDT
  WDTCTL = WDTPW + WDTHOLD;

  // 1 MHz clock
  DCOCTL = 0;
  BCSCTL1 = CALBC1_1MHZ;
  DCOCTL = CALDCO_1MHZ;

  // Enable pullup on P1.3
  P1OUT &= 0x00;
  P1DIR &= 0x00;
  P1REN |= BIT3;
  P1OUT |= BIT3;

  // Configure P1.1 and P1.2 as UART lines
  P1SEL |= RXD | TXD ; // P1.1 = RXD, P1.2=TXD
  P1SEL2 |= RXD | TXD ; // P1.1 = RXD, P1.2=TXD

  // Enable pin interrupt on P1.3
  P1IE |= BIT3;
  P1IES |= BIT3;
  P1IFG &= ~BIT3;

  // Configure the UART
  UCA0CTL1 |= UCSSEL_2; // SMCLK
  UCA0BR0 = 0x08; // 1MHz 115200
  UCA0BR1 = 0x00; // 1MHz 115200
  UCA0MCTL = UCBRS2 + UCBRS0; // Modulation UCBRSx = 5
  UCA0CTL1 &= ~UCSWRST; // **Initialize USCI state machine**
  /// UC0IE |= UCA0RXIE; // Enable USCI_A0 RX interrupt

  _BIS_GR(GIE);

  int str_pos = 0;
  while (1) {
    while (!(IFG2 & UCA0RXIFG));
    if (UCA0RXBUF == query_str[str_pos]) {
      ++str_pos;
    } else {
      str_pos = 0;
    }
    if (str_pos > 7) {
      print_code();
      str_pos = 0;
    }
  }
}

#pragma vector=TIMERA0_VECTOR
__interrupt void timera_isr() {
}

#pragma vector=PORT01_VECTOR
__interrupt void port1_isr() {
}


void rly_uartch(char ch) {
  while (!(IFG2 & UCA0TXIFG));
  UCA0TXBUF = ch;
}

void rly_uarts(char* s) {
  while (!*s) {
    rly_uartch(*s);
    ++s;
  }
}

char buf[6];
int fill = 0;
void uartch(char ch) {
  ++fill;
  char out = buf[0];
  for (int i = 0; i < 5; i++) {
    buf[i] = buf[i + 1];
  }
  buf[5] = ch;
  if (strncmp(buf, "\nCODE;", 6) == 0) {
    // TODO: print out the code declaration
    rly_uarts("\nconst uint8_t code[] = {");
    rly_uarts("};");
    fill = 0;
  } else if (strncmp(buf, "\nDICT;", 6) == 0) {
    // TODO: print out the data declaration
    rly_uarts("\nconst uint16_t huffman[] = {");
    rly_uarts("};");
    fill = 0;
  } else if (fill > 6) {
    rly_uartch(out);
  }
}

void FLUSH() {
  if (fill > 6) fill = 6;
  for (int i = fill; i > 0; --i) {
    rly_uartch(buf[6-i]);
  }
}

uint8_t window[256];
int last_offset = -1, off = 0;

void OFFSET(int offset) {
  last_offset = offset;
}

void LITERAL(int literal) {
  if (last_offset > 0) {
    for (int i = 0; i < literal; ++i) {
      const uint8_t c = window[(256 + off - last_offset) % 256];

      window[off] = c;
      off = (off + 1) % 256;

      uartch(ch);
    }
    last_offset = -1;
  } else {
    window[off] = (char) literal;
    off = (off + 1) % 256;
    uartch((char)literal);
  }
}

///AUTOGEN START
///AUTOGEN END
